
Функция ПолучитьДанныеПоНоменклатуреGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	
	СтрокаJSON = ex_http_ОбщегоНазначения.ПолучитьНоменклатуру();
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;
КонецФункции

Функция ПолучитьНоменклатуруПоШтрихкодуGET(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Штрихкод = Запрос.ПараметрыURL["barcode"];
	
	СтрокаJSON = ex_http_ОбщегоНазначения.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
	Ответ.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Возврат Ответ;
КонецФункции
