Функция ПолучитьНоменклатуру()Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК barcode,
	|	Штрихкоды.Номенклатура.Код КАК cod,
	|	Штрихкоды.Номенклатура.Наименование КАК name,
	|	Штрихкоды.Номенклатура.Артикул КАК articul
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Массив = Новый Массив;
	Пока Выборка.Следующий()Цикл
		Структура = Новый Структура("barcode, cod, name, articul");
		ЗаполнитьЗначенияСвойств(Структура, Выборка);
		Массив.Добавить(Структура);
	КонецЦикла;
	
	СтрокаJSON = В_JSON(Массив);
	
	Возврат СтрокаJSON;
	
КонецФункции

Функция В_JSON(Массив)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Массив);
	
	СтрокаJSON = ЗаписьJSON.Закрыть();
	
	Возврат СтрокаJSON;
	
КонецФункции
